Revit 2027 API
Entity.SchemaGUID Property
 The GUID of the Schema describing this Entity.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid SchemaGUID { get; }
Public ReadOnly Property SchemaGUID As Guid
	Get
public:
property Guid SchemaGUID {
	Guid get ();
}
member SchemaGUID : Guid with get
Property Value
Guid
See Also
Reference
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace